{
    "qacall": "Got questions? Call us 24/7!",
    "VerifyMnemNote": "To make sure that you copied the mnemonics accurately, please enter it in order for verification.",
    "PwdNote": "Please note, this password is only for proectting wallet information in this device, it is not wallet private key.",
    "Wnvalid": "Wallet name must be 2 or more letters or numbers",
    "creacount": "Create new account today to reap the benefits of a personalized shopping experience.",
    "privacywarn": "Your personal data will be used to support your experience throughout this website, to manage your account, and for other purposes described in our",
    "Pwdvalid": "Password must be at least 8 characters including at least 1 upper case letter, 1 lower case letter and 1 special character(!@#$%^&*~`)",
    "Wallet Name": "Wallet Name",
    "Password doesn't match": "Password doesn't match",
    "Password": "Password",
    "Wallet Password": "Wallet Password",
    "Confirm Password": "Confirm Password",
    "Back": "Back",
    "Insufficient Coin": "Insufficient {{coin}} for this transaction",
    "Show more": "Show more",
    "Show less": "Show less",
    "InstructionDetails": "<div>Collection Gala is <strong>decentralized</strong>,so we never escrow your items.</div><div>As a result, you need to sign for your listing and orders</div><div>Note that you can always change the price of your listing for free, without making a transaction or paying gas. You can view all your items <a href=\"/nft/assets\">here</a>.</div>",
    "Under $25": "Under $25",
    "$25 to $50": "$25 to $50",
    "$50 to $100": "$50 to $100",
    "$100 to $200": "$100 to $200",
    "Copyright": " CollectionGala All Rights Reserved",
    "$200 & Above": "$200 & Above",
    "Type wallet name": "Type wallet name",
    "Type wallet password": "Type wallet password",
    "Confirm Wallet Password": "Confirm Wallet Password",
    "Seed phrase, seperated by space": "Seed phrase, seperated by space",
    "Seed Phrase is invalid": "Seed Phrase is invalid",
    "Already have mnemonics? Restore": "Already have mnemonics? Restore",
    "Next": "Next",
    "Apply for merchant": "Apply for merchant",
    "Merchant Application": "Merchant Application",
    "Your password is invalid.": "Your password is invalid.",
    "Ok": "Ok",
    "My store": "My store",
    "Merchant name": "Merchant name",
    "Phone": "Phone",
    "Main Layout": "Main Layout",
    "Filters": "Filters",
    "Color": "Color",
    "Merchant Applications": "Merchant Applications",
    "Filter": "Filter",
    "Latest Products": "Latest Products",
    "Show All Categories": "Show All Categories",
    "Social": {
        "Title": "Stay In Touch",
        "TitleSub": "Contact us to get more information about our free coin giveaway event.",
        "Button": "JOIN"
    },
    "Error occured, please try again.": "Error occured, please try again.",
    "Restore Wallet": "Restore Wallet",
    "Backup Wallet Seed Phrases": "Backup Wallet Seed Phrases",
    "MnemNote": "Please accurately record and securely store the following twelve word mnemonic SEED, do not disclose the mnemonic SEED to anybody else. Disclosure of your mnemonic SEED will result in your account being compromised and you will lose all of your funds. Safely store your mnemonic SEED such that the loss or damage of a device does not impact your ability to access your mnemonic SEED. It is recommended to never send your mnemonic SEED via email or other social communication application. Be sure to only use your mnemonic SEED with the official eXchangily wallet.",
    "welcome_to": "Welcome to CollectionGala.com is built on Fast Access Blockchain (FAB), it is the premier destination for discovering, acquiring, and showcasing exceptional non-fungible tokens (NFTs) from around the globe. Our platform is designed to cater to a diverse range of collectors, artists, and enthusiasts who appreciate the unique value of digital art and collectibles.",
    "at_collectiongala": "At CollectionGala, we pride ourselves on curating an exclusive selection of the wide range of choices of NFTs across various categories, including digital art, gaming, sports, music, and virtual real estate. Our user-friendly interface and advanced search features make it easy to navigate through our extensive gallery and find the perfect addition to your growing NFT portfolio.",
    "our_mission": "Our mission is to empower creators by providing them with a platform to showcase their talents and connect with a global audience of collectors. CollectionGala supports artists with fair compensation models, ensuring they receive the recognition and rewards they deserve.",
    "thriving_community_hub": "In addition to being a marketplace for buying and selling NFTs, CollectionGala is also a thriving community hub. We host events, exhibitions, and discussions, fostering a sense of camaraderie among our members. By joining CollectionGala, you're not only gaining access to an exquisite collection of NFTs but also becoming part of a vibrant network of like-minded individuals who share your passion for digital art and collectibles.",
    "dive_into": "Dive into the fascinating world of NFTs at CollectionGala.com and uncover hidden gems that will captivate, inspire, and redefine your perception of digital art. Sign up today and embark on an unforgettable journey through the ever-evolving landscape of non-fungible tokens."
}